IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_G3_EPWM19_CONTROLSS_G3_EPWM19.xml
	<register id="CONTROLSS_G3_EPWM19_XCMP7_SHDW3" acronym="CONTROLSS_G3_EPWM19_XCMP7_SHDW3" offset="0x798" width="32" description="Additional Compare 7 Shadow 3 Register">
		<bitfield id="XCMP7_SHDW3" width="16" begin="31" end="16" resetval="0x0" description="XCMP7_SHDW3 Register The value in the XCMP7_SHDW3 register is loaded into XCMP7_ACTIVE register when shadow to active load occurs." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="XCMP7HR_SHDW3" width="16" begin="15" end="0" resetval="0x0" description="XCMP7HR_SHDW3 Register  The value in the XCMP7HR_SHDW3 register is loaded into XCMP7HR_ACTIVE register when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM19_XCMP8_SHDW3" acronym="CONTROLSS_G3_EPWM19_XCMP8_SHDW3" offset="0x79C" width="32" description="Additional Compare 8 Shadow 3 Register">
		<bitfield id="XCMP8_SHDW3" width="16" begin="31" end="16" resetval="0x0" description="XCMP8_SHDW3 Register The value in the XCMP8_SHDW3 register is loaded into XCMP8_ACTIVE register when shadow to active load occurs." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="XCMP8HR_SHDW3" width="16" begin="15" end="0" resetval="0x0" description="XCMP8HR_SHDW3 Register  The value in the XCMP8HR_SHDW3 register is loaded into XCMP8HR_ACTIVE register when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM19_XTBPRD_SHDW3" acronym="CONTROLSS_G3_EPWM19_XTBPRD_SHDW3" offset="0x7A0" width="32" description="Additional Time Base Period Shadow 3 Register">
		<bitfield id="XTBPRD_SHDW3" width="16" begin="31" end="16" resetval="0x0" description="The value in the XTBPRD_SHDW3 register is loaded into XTBPRD_ ACTIVE register when shadow to active load occurs." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="XTBPRDHR_SHDW3" width="16" begin="15" end="0" resetval="0x0" description="The value in the XTBPRDHR_SHDW3 register is loaded into XTBPRDHR_ACTIVE register when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM19_XAQCTLA_SHDW3" acronym="CONTROLSS_G3_EPWM19_XAQCTLA_SHDW3" offset="0x7B0" width="16" description="XAQCTLA Shadow 3 Register">
		<bitfield id="XCMP8" width="2" begin="15" end="14" resetval="0x0" description="Action when Counter = CMP8 0,0 Do nothing [action disabled] 0,1 Clear [low] 1,0 Set [high] 1,1 Toggle [Low -> High, High -> Low]" range="15 - 14" rwaccess="R/W"/> 
		<bitfield id="XCMP7" width="2" begin="13" end="12" resetval="0x0" description="Action when Counter = CMP7 0,0 Do nothing [action disabled] 0,1 Clear [low] 1,0 Set [high] 1,1 Toggle [Low -> High, High -> Low]" range="13 - 12" rwaccess="R/W"/> 
		<bitfield id="XCMP6" width="2" begin="11" end="10" resetval="0x0" description="Action when Counter = CMP6 0,0 Do nothing [action disabled] 0,1 Clear [low] 1,0 Set [high] 1,1 Toggle [Low -> High, High -> Low]" range="11 - 10" rwaccess="R/W"/> 
		<bitfield id="XCMP5" width="2" begin="9" end="8" resetval="0x0" description="Action when Counter = CMP5 0,0 Do nothing [action disabled] 0,1 Clear [low] 1,0 Set [high] 1,1 Toggle [Low -> High, High -> Low]" range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="XCMP4" width="2" begin="7" end="6" resetval="0x0" description="Action when Counter = CMP4 0,0 Do nothing [action disabled] 0,1 Clear [low] 1,0 Set [high] 1,1 Toggle [Low -> High, High -> Low]" range="7 - 6" rwaccess="R/W"/> 
		<bitfield id="XCMP3" width="2" begin="5" end="4" resetval="0x0" description="Action when Counter = CMP3 0,0 Do nothing [action disabled] 0,1 Clear [low] 1,0 Set [high] 1,1 Toggle [Low -> High, High -> Low]" range="5 - 4" rwaccess="R/W"/> 
		<bitfield id="XCMP2" width="2" begin="3" end="2" resetval="0x0" description="Action when Counter = CMP2 0,0 Do nothing [action disabled] 0,1 Clear [low] 1,0 Set [high] 1,1 Toggle [Low -> High, High -> Low]" range="3 - 2" rwaccess="R/W"/> 
		<bitfield id="XCMP1" width="2" begin="1" end="0" resetval="0x0" description="Action when Counter = CMP1 0,0 Do nothing [action disabled] 0,1 Clear [low] 1,0 Set [high] 1,1 Toggle [Low -> High, High -> Low]" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM19_XAQCTLB_SHDW3" acronym="CONTROLSS_G3_EPWM19_XAQCTLB_SHDW3" offset="0x7B2" width="16" description="XAQCTLB Shadow 3 Register">
		<bitfield id="XCMP8" width="2" begin="15" end="14" resetval="0x0" description="Action when Counter = CMP8 0,0 Do nothing [action disabled] 0,1 Clear [low] 1,0 Set [high] 1,1 Toggle [Low -> High, High -> Low]" range="15 - 14" rwaccess="R/W"/> 
		<bitfield id="XCMP7" width="2" begin="13" end="12" resetval="0x0" description="Action when Counter = CMP7 0,0 Do nothing [action disabled] 0,1 Clear [low] 1,0 Set [high] 1,1 Toggle [Low -> High, High -> Low]" range="13 - 12" rwaccess="R/W"/> 
		<bitfield id="XCMP6" width="2" begin="11" end="10" resetval="0x0" description="Action when Counter = CMP6 0,0 Do nothing [action disabled] 0,1 Clear [low] 1,0 Set [high] 1,1 Toggle [Low -> High, High -> Low]" range="11 - 10" rwaccess="R/W"/> 
		<bitfield id="XCMP5" width="2" begin="9" end="8" resetval="0x0" description="Action when Counter = CMP5 0,0 Do nothing [action disabled] 0,1 Clear [low] 1,0 Set [high] 1,1 Toggle [Low -> High, High -> Low]" range="9 - 8" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM19_CMPC_SHDW3" acronym="CONTROLSS_G3_EPWM19_CMPC_SHDW3" offset="0x7BA" width="16" description="CMPC Shadow 3 Register">
		<bitfield id="CMPC_SHDW3" width="16" begin="15" end="0" resetval="0x0" description="The value in the CMPC_SHDW3 register is loaded into CMPC_ACTIVE register when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM19_CMPD_SHDW3" acronym="CONTROLSS_G3_EPWM19_CMPD_SHDW3" offset="0x7BE" width="16" description="CMPD Shadow 3 Register">
		<bitfield id="CMPD_SHDW3" width="16" begin="15" end="0" resetval="0x0" description="The value in the CMPD_SHDW3 register is loaded into CMPD_ACTIVE register when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM19_XMINMAX_SHDW3" acronym="CONTROLSS_G3_EPWM19_XMINMAX_SHDW3" offset="0x7C4" width="32" description="XMINMAX Shadow 3 Register">
		<bitfield id="XMIN_SHDW3" width="16" begin="31" end="16" resetval="0x0" description="The value in the XMIN_SHDW3 register is loaded into XMIN_ACTIVE register when shadow to active load occurs." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="XMAX_SHDW3" width="16" begin="15" end="0" resetval="0x0" description="The value in the XMAX_SHDW3 register is loaded into XMAX_ACTIVE register when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM19_DECTL" acronym="CONTROLSS_G3_EPWM19_DECTL" offset="0x800" width="32" description="DE control register">
		<bitfield id="REENTRYDLY" width="8" begin="15" end="8" resetval="0x0" description="Determines the blocking window after DEACTIVE flag is cleared in which setting of DEACTIVE flag is prevented from being set. 0 : No blocking 1 : Blocked until 1 PWMSYNCOUT event 2 : Blocked until 2 PWMSYNCOUT events . . 255 : Blocked until 127 PWMSYNCOUT events" range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="MODE" width="1" begin="1" end="1" resetval="0x0" description="0 : DEACTIVE flag works in cycle by cycle mode. On every PWMSYNCOUT, set condition of DEACTIVE flag is evaluated. If the set condition is not present the flag is cleared. 1 : DEACTIVE flag works in one shot mode [hardware set] and software clear." range="1" rwaccess="R/W"/> 
		<bitfield id="ENABLE" width="1" begin="0" end="0" resetval="0x0" description="DE function enable 0 : Diode Emulation mode functionality is disabled. DEACTIVE flag is not set on a TRIPH_OR_TRIPL event. 1 : Diode Emulation mode functionality is enabled. DEACTIVE flag is set on a TRIPH_OR_TRIPL event.  Note: ENABLE bit is cleared on a PWMTRIP event. Software has to re-enable this bit after PWMTRIP condition is serviced." range="0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM19_DECOMPSEL" acronym="CONTROLSS_G3_EPWM19_DECOMPSEL" offset="0x804" width="32" description="Used to configure the comparator whose trip sources will be used.">
		<bitfield id="TRIPH" width="6" begin="21" end="16" resetval="0x0" description="000000 : Reserved 000001 : Input-XBAR[0] is the source of TRIPH 000010 : Input-XBAR[1] is the source of TRIPH . . 100000 : Input-XBAR[31] is the source of TRIPH 100001 : CMPSSA0 is the source of TRIPH 100010 : CMPSSA1 is the source of TRIPH . . 101010 : CMPSSA9 is the source of TRIPH 101011 : Reserved . . 110000 : Reserved 110001 : CMPSSB0 is the source of TRIPH 110010 : CMPSSB1 is the source of TRIPH . . 111010 : CMPSSB9 is the source of TRIPH 111011 : Reserved . . 111111 : Reserved Note: All the reserved encodings result in TRIPH being 0." range="21 - 16" rwaccess="R/W"/> 
		<bitfield id="TRIPL" width="6" begin="5" end="0" resetval="0x0" description="000000 : Reserved 000001 : Input-XBAR[0] is the source of TRIPL 000010 : Input-XBAR[1] is the source of TRIPL . . 100000 : Input-XBAR[31] is the source of TRIPL 100001 : CMPSSA0 is the source of TRIPL 100010 : CMPSSA1 is the source of TRIPL . . 101010 : CMPSSA9 is the source of TRIPL 101011 : Reserved . . 110000 : Reserved 110001 : CMPSSB0 is the source of TRIPL 110010 : CMPSSB1 is the source of TRIPL . . 111010 : CMPSSB9 is the source of TRIPL 111011 : Reserved . . 111111 : Reserved Note: All the reserved encodings result in TRIPL being 0." range="5 - 0" rwaccess="R/W"/>
	</register>
